hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
void DMA1_Channel2_3_IRQHandler() {
   DMA_ClearITPendingBit(DMA1_IT_TC2);
}

/**
 * TIM6 and DAC
 */
void TIM6_DAC_IRQHandler() {
   TIM_ClearITPendingBit(TIM6, TIM_IT_Update);

   response_timeout_timer++;
   if (!is_esp8266_enabled(0)) {
      esp8266_disabled_counter++;
   }
   if (esp8266_disabled_timer > 0) {
      esp8266_disabled_timer--;
   }
}

void TIM3_IRQHandler() {
   TIM_ClearITPendingBit(TIM3, TIM_IT_Update);

   // Some error eventually occurs when only the first symbol is exists
   if (usart_received_bytes > 1) {
      set_flag(&general_flags, USART_DATA_RECEIVED_FLAG);
   }
   usart_received_bytes = 0;
   if (send_usart_data_function != NULL || resending_requests_counter) {
      send_usart_data_timer_counter++;
   }
   network_searching_status_led_counter++;
}

void USART1_IRQHandler() {
   if (USART_GetFlagStatus(USART1, USART_FLAG_ORE)) {
      USART_ClearITPendingBit(USART1, USART_IT_ORE);
      USART_ClearFlag(USART1, USART_FLAG_ORE);
      usart_overrun_errors_counter++;
   } else if (USART_GetFlagStatus(USART1, USART_FLAG_IDLE)) {
      USART_ClearITPendingBit(USART1, USART_IT_ORE);
      USART_ClearFlag(USART1, USART_FLAG_IDLE);
      usart_idle_line_detection_counter++;
   } else if (USART_GetFlagStatus(USART1, USART_FLAG_NE)) {
      USART_ClearITPendingBit(USART1, USART_IT_ORE);
      USART_ClearFlag(USART1, USART_FLAG_NE);
      usart_noise_detection_counter++;
   } else if (USART_GetFlagStatus(USART1, USART_FLAG_FE)) {
      USART_ClearITPendingBit(USART1, USART_IT_ORE);
      USART_ClearFlag(USART1, USART_FLAG_FE);
      usart_framing_errors_counter++;
   } else if (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == SET) {
      TIM_SetCounter(TIM3, 0);
      usart_data_received_buffer[usart_received_bytes] = USART_ReceiveData(USART1);
      usart_received_bytes++;

      if (usart_received_bytes >= USART_DATA_RECEIVED_BUFFER_SIZE) {
         usart_received_bytes = 0;
      }
   }
}

int main() {
   Clock_Config();
   Pins_Config();
   disable_esp8266();
   DMA_Config();
   USART_Config();
   TIMER3_Confing();
   TIMER6_Confing();

   add_piped_task_to_send_into_tail(DISABLE_ECHO_FLAG);
   add_piped_task_to_send_into_tail(GET_CURRENT_DEFAULT_WIFI_MODE_FLAG);
   add_piped_task_to_send_into_tail(GET_OWN_IP_ADDRESS_FLAG);
   add_piped_task_to_send_into_tail(OBTAIN_CONNECTION_STATUS_FLAG);

   while (1) {
      if (is_esp8266_enabled(1)) {
         // Seconds
         unsigned char send_usart_data_passed_time_sec = (unsigned char)(TIMER3_PERIOD_SEC * send_usart_data_timer_counter);

         if (read_flag_state(&general_flags, USART_DATA_RECEIVED_FLAG)) {
            reset_flag(&general_flags, USART_DATA_RECEIVED_FLAG);
            send_usart_data_timer_counter = 0;

            if (usart_data_to_be_transmitted_buffer != NULL) {
               free(usart_data_to_be_transmitted_buffer);
               usart_data_to_be_transmitted_buffer = NULL;
            }

            set_appropriate_successfully_recieved_flag();
         } else if (send_usart_data_function != NULL && send_usart_data_passed_time_sec >= send_usart_data_timout_sec) {
            send_usart_data_timer_counter = 0;
            if (usart_data_to_be_transmitted_buffer != NULL) {
               free(usart_data_to_be_transmitted_buffer);
               usart_data_to_be_transmitted_buffer = NULL;
            }

            send_usart_data_function();
         }

         if (successfully_received_flags) {
            if (read_flag_state(&successfully_received_flags, DISABLE_ECHO_FLAG)) {
               on_successfully_receive_general_actions(DISABLE_ECHO_FLAG);
            }
            if (read_flag_state(&successfully_received_flags, OBTAIN_CONNECTION_STATUS_FLAG)) {
               on_successfully_receive_general_actions(OBTAIN_CONNECTION_STATUS_FLAG);

               if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME)) {
                  // Has already been connected
                  set_flag(&general_flags, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
                  GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
               } else if (is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
                  // Connect
                  add_piped_task_to_send_into_tail(GET_VISIBLE_NETWORK_LIST_FLAG);
                  add_piped_task_to_send_into_tail(CONNECT_TO_NETWORK_FLAG);
               }
            }
            if (read_flag_state(&successfully_received_flags, GET_VISIBLE_NETWORK_LIST_FLAG)) {
               on_successfully_receive_general_actions(GET_VISIBLE_NETWORK_LIST_FLAG);
            }
            if (read_flag_state(&successfully_received_flags, CONNECT_TO_NETWORK_FLAG)) {
               on_successfully_receive_general_actions(CONNECT_TO_NETWORK_FLAG);

               set_flag(&general_flags, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
            }
            if (read_flag_state(&successfully_received_flags, CONNECT_TO_SERVER_FLAG)) {
               on_successfully_receive_general_actions(CONNECT_TO_SERVER_FLAG);
            }
            if (read_flag_state(&successfully_received_flags, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG)) {
               on_successfully_receive_general_actions(BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
            }
            if (read_flag_state(&successfully_received_flags, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG)) {
               on_successfully_receive_general_actions(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);

               resending_requests_counter = 0;
               if (on_response != NULL) {
                  on_response();
                  on_response = NULL;
               }
            }
            if (read_flag_state(&successfully_received_flags, GET_CURRENT_DEFAULT_WIFI_MODE_FLAG)) {
               on_successfully_receive_general_actions(GET_CURRENT_DEFAULT_WIFI_MODE_FLAG);

               if (!is_usart_response_contains_element(ESP8226_RESPONSE_WIFI_STATION_MODE)) {
                  add_piped_task_to_send_into_head(SET_DEFAULT_STATION_WIFI_MODE_FLAG);
               }
            }
            if (read_flag_state(&successfully_received_flags, SET_DEFAULT_STATION_WIFI_MODE_FLAG)) {
               on_successfully_receive_general_actions(SET_DEFAULT_STATION_WIFI_MODE_FLAG);
            }
            if (read_flag_state(&successfully_received_flags, GET_OWN_IP_ADDRESS_FLAG)) {
               on_successfully_receive_general_actions(GET_OWN_IP_ADDRESS_FLAG);

