hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
               unsigned char some_another_ip = !is_usart_response_contains_element(ESP8226_OWN_IP_ADDRESS);
               if (some_another_ip) {
                  add_piped_task_to_send_into_head(SET_OWN_IP_ADDRESS_FLAG);
               }
            }
            if (read_flag_state(&successfully_received_flags, SET_OWN_IP_ADDRESS_FLAG)) {
               on_successfully_receive_general_actions(SET_OWN_IP_ADDRESS_FLAG);
            }
            if (read_flag_state(&successfully_received_flags, CLOSE_CONNECTION_FLAG)) {
               on_successfully_receive_general_actions(CLOSE_CONNECTION_FLAG);
            }
         }

         unsigned short current_piped_task_to_send = get_current_piped_task_to_send();
         execute_function_for_current_piped_task(current_piped_task_to_send, send_usart_data_passed_time_sec);

         // LED blinking
         if (network_searching_status_led_counter >= TIMER3_100MS && !read_flag_state(&general_flags, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG)) {
            network_searching_status_led_counter = 0;

            if (read_flag_state(&general_flags, NETWORK_SEARCHING_STATUS_LED_FLAG)) {
               reset_flag(&general_flags, NETWORK_SEARCHING_STATUS_LED_FLAG);
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
            } else {
               set_flag(&general_flags, NETWORK_SEARCHING_STATUS_LED_FLAG);
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_RESET);
            }
         }

         if (response_timeout_timer > TIMER6_10S && !current_piped_task_to_send) {
            response_timeout_timer = 0;

            if (read_flag_state(&general_flags, SENDING_USART_ERRORS_OVERFLOW_FLAG)) {
               reset_flag(&general_flags, SENDING_USART_ERRORS_OVERFLOW_FLAG);

               char request_template[] = "GET /extjs/5errors.txt HTTP/1.1\r\nHost: {1}\r\nUser-Agent: ESP8266\r\nAccept: text/html\r\nConnection: close\r\n\r\n";
               char *parameter_for_request[] = {"192.168.0.2", NULL};
               char *request = set_string_parameters(request_template, parameter_for_request);
               send_usart_get_request("192.168.0.2", "80", request, action_on_response);
            } else {
               char request_template[] = "GET /extjs/tmp.txt HTTP/1.1\r\nHost: {1}\r\nUser-Agent: ESP8266\r\nAccept: text/html\r\nConnection: close\r\n\r\n";
               char *parameter_for_request[] = {"192.168.0.2", NULL};
               char *request = set_string_parameters(request_template, parameter_for_request);
               send_usart_get_request("192.168.0.2", "80", request, action_on_response);
            }
         }

         if (send_usart_data_errors_counter > 5 || resending_requests_counter > 10) {
            set_flag(&general_flags, SENDING_USART_ERRORS_OVERFLOW_FLAG);
            send_usart_data_errors_counter = 0;
            resending_requests_counter = 0;

            delete_all_piped_tasks();
            clear_piped_request_commands_to_send();
            on_response = NULL;
            send_usart_data_function = NULL;

            successfully_received_flags = 0;
            sent_flag = 0;
         }
      } else if (esp8266_disabled_counter >= TIMER6_1S) {
         esp8266_disabled_counter = 0;
         enable_esp8266();
      }
   }
}

void execute_function_for_current_piped_task(unsigned short current_piped_task_to_send, unsigned char send_usart_data_passed_time_sec) {
   if (send_usart_data_function == NULL && current_piped_task_to_send) {
      if (current_piped_task_to_send == DISABLE_ECHO_FLAG) {
         execute_usart_data_sending(disable_echo, 2);
      } else if (current_piped_task_to_send == OBTAIN_CONNECTION_STATUS_FLAG) {
         execute_usart_data_sending(get_connection_status, 2);
      } else if (current_piped_task_to_send == GET_VISIBLE_NETWORK_LIST_FLAG) {
         execute_usart_data_sending(get_network_list, 30);
      } else if (current_piped_task_to_send == CONNECT_TO_NETWORK_FLAG) {
         execute_usart_data_sending(connect_to_network, 10);
      } else if (current_piped_task_to_send == CONNECT_TO_SERVER_FLAG) {
         execute_usart_data_sending(connect_to_server, 2);
      } else if (current_piped_task_to_send == BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG) {
         execute_usart_data_sending(set_bytes_amount_to_send, 2);
      } else if (current_piped_task_to_send == GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG) {
         execute_usart_data_sending(send_request, 2);
      } else if (current_piped_task_to_send == GET_CURRENT_DEFAULT_WIFI_MODE_FLAG) {
         execute_usart_data_sending(get_current_default_wifi_mode, 2);
      } else if (current_piped_task_to_send == SET_DEFAULT_STATION_WIFI_MODE_FLAG) {
         execute_usart_data_sending(set_default_wifi_mode, 2);
      } else if (current_piped_task_to_send == GET_OWN_IP_ADDRESS_FLAG) {
         execute_usart_data_sending(get_own_ip_address, 5);
      } else if (current_piped_task_to_send == SET_OWN_IP_ADDRESS_FLAG) {
         execute_usart_data_sending(set_own_ip_address, 2);
      } else if (current_piped_task_to_send == CLOSE_CONNECTION_FLAG &&
            (!resending_requests_counter || (resending_requests_counter && send_usart_data_passed_time_sec >= 4))) {
         execute_usart_data_sending(close_connection, 5);
      }
   }
}

void set_appropriate_successfully_recieved_flag() {
   if (read_flag_state(&sent_flag, DISABLE_ECHO_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(DISABLE_ECHO_FLAG, USART_OK);
   }
   if (read_flag_state(&sent_flag, GET_VISIBLE_NETWORK_LIST_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(GET_VISIBLE_NETWORK_LIST_FLAG, DEFAULT_ACCESS_POINT_NAME);
   }
   if (read_flag_state(&sent_flag, CONNECT_TO_NETWORK_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(CONNECT_TO_NETWORK_FLAG, USART_OK);
   }
   if (read_flag_state(&sent_flag, OBTAIN_CONNECTION_STATUS_FLAG)) {
      reset_flag(&sent_flag, OBTAIN_CONNECTION_STATUS_FLAG);

      if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME) ||
            is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
         set_flag(&successfully_received_flags, OBTAIN_CONNECTION_STATUS_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, CONNECT_TO_SERVER_FLAG)) {
      reset_flag(&sent_flag, CONNECT_TO_SERVER_FLAG);

      char *data_to_be_contained[] = {ESP8226_RESPONSE_CONNECTED, USART_OK};
      if (is_usart_response_contains_elements(data_to_be_contained, 2) ||
            is_usart_response_contains_element(ESP8226_RESPONSE_ALREADY_CONNECTED)) {
         set_flag(&successfully_received_flags, CONNECT_TO_SERVER_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG)) {
      reset_flag(&sent_flag, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);

      if (is_usart_response_contains_element(ESP8226_RESPONSE_START_SENDING_READY)) {
         set_flag(&successfully_received_flags, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
      } else {
         resend_usart_get_request();
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG)) {
      reset_flag(&sent_flag, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);

      char *data_to_be_contained[] = {ESP8226_RESPONSE_SUCCSESSFULLY_SENT, ESP8226_RESPONSE_PREFIX};
      if (is_usart_response_contains_elements(data_to_be_contained, 2)) {
         set_flag(&successfully_received_flags, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
      } else {
         resend_usart_get_request();
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, GET_CURRENT_DEFAULT_WIFI_MODE_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(GET_CURRENT_DEFAULT_WIFI_MODE_FLAG, ESP8226_RESPONSE_WIFI_MODE_PREFIX);
   }
   if (read_flag_state(&sent_flag, SET_DEFAULT_STATION_WIFI_MODE_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(SET_DEFAULT_STATION_WIFI_MODE_FLAG, USART_OK);
   }
   if (read_flag_state(&sent_flag, GET_OWN_IP_ADDRESS_FLAG)) {
      reset_flag(&sent_flag, GET_OWN_IP_ADDRESS_FLAG);

      if (is_usart_response_contains_element(ESP8226_OWN_IP_ADDRESS) ||
            is_usart_response_contains_element(ESP8226_RESPONSE_CURRENT_OWN_IP_ADDRESS_PREFIX)) {
         set_flag(&successfully_received_flags, GET_OWN_IP_ADDRESS_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, SET_OWN_IP_ADDRESS_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(SET_OWN_IP_ADDRESS_FLAG, USART_OK);
   }
   if (read_flag_state(&sent_flag, CLOSE_CONNECTION_FLAG)) {
      reset_flag(&sent_flag, CLOSE_CONNECTION_FLAG);
      set_flag(&successfully_received_flags, CLOSE_CONNECTION_FLAG);
   }
}

void set_appropriate_successfully_recieved_flag_general_action(unsigned int flag_value, char to_be_contained_in_response[]) {
   reset_flag(&sent_flag, flag_value);

   if (is_usart_response_contains_element(to_be_contained_in_response)) {
      set_flag(&successfully_received_flags, flag_value);
   } else {
      send_usart_data_errors_counter++;
   }
}

void get_own_ip_address() {
   send_usard_data(ESP8226_REQUEST_GET_OWN_IP_ADDRESS);
   set_flag(&sent_flag, GET_OWN_IP_ADDRESS_FLAG);
}

