hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
void set_own_ip_address() {
   char *parameters[] = {ESP8226_OWN_IP_ADDRESS, NULL};
   usart_data_to_be_transmitted_buffer = set_string_parameters(ESP8226_REQUEST_SET_OWN_IP_ADDRESS, parameters);
   send_usard_data(usart_data_to_be_transmitted_buffer);
   set_flag(&sent_flag, SET_OWN_IP_ADDRESS_FLAG);
}

void close_connection() {
   send_usard_data(ESP8226_REQUEST_DISCONNECT_FROM_SERVER);
   set_flag(&sent_flag, CLOSE_CONNECTION_FLAG);
}

void get_current_default_wifi_mode() {
   send_usard_data(ESP8226_REQUEST_GET_CURRENT_DEFAULT_WIFI_MODE);
   set_flag(&sent_flag, GET_CURRENT_DEFAULT_WIFI_MODE_FLAG);
}

void set_default_wifi_mode() {
   send_usard_data(ESP8226_REQUEST_SET_DEFAULT_STATION_WIFI_MODE);
   set_flag(&sent_flag, SET_DEFAULT_STATION_WIFI_MODE_FLAG);
}

void action_on_response() {
   clear_piped_request_commands_to_send();
}

/**
 * address, port and request shall be allocated with malloc. Later they will be removed with free
 */
void send_usart_get_request(char address[], char port[], char request[], void (*execute_on_response)()) {
   clear_piped_request_commands_to_send();
   char *parameters[] = {address, port, NULL};
   piped_request_commands_to_send[PIPED_REQUEST_CIPSTART_COMMAND_INDEX] = set_string_parameters(ESP8226_REQUEST_CONNECT_TO_SERVER, parameters);

   unsigned short request_length = get_string_length(request);
   char *request_length_string = short_to_string(request_length);
   char *start_sending_parameters[] = {request_length_string, NULL};
   piped_request_commands_to_send[PIPED_REQUEST_CIPSEND_COMMAND_INDEX] = set_string_parameters(ESP8226_REQUEST_START_SENDING, start_sending_parameters);
   free(request_length_string);
   piped_request_commands_to_send[PIPED_REQUEST_INDEX] = request;

   on_response = execute_on_response;

   add_piped_task_to_send_into_tail(CONNECT_TO_SERVER_FLAG);
   add_piped_task_to_send_into_tail(BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
   add_piped_task_to_send_into_tail(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
}

void resend_usart_get_request() {
   send_usart_data_timer_counter = 0;
   resending_requests_counter++;
   send_usart_data_function = NULL;
   delete_piped_task(BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
   delete_piped_task(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);

   add_piped_task_to_send_into_tail(CLOSE_CONNECTION_FLAG);
   add_piped_task_to_send_into_tail(CONNECT_TO_SERVER_FLAG);
   add_piped_task_to_send_into_tail(BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
   add_piped_task_to_send_into_tail(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
}

void clear_piped_request_commands_to_send() {
   for (unsigned char i = 0; i < PIPED_REQUEST_COMMANDS_TO_SEND_SIZE; i++) {
      char *command = piped_request_commands_to_send[i];
      if (command != NULL) {
         free(command);
         piped_request_commands_to_send[i] = NULL;
      }
   }
}

void connect_to_server() {
   if (piped_request_commands_to_send[PIPED_REQUEST_CIPSTART_COMMAND_INDEX] == NULL) {
      return;
   }

   send_usard_data(piped_request_commands_to_send[PIPED_REQUEST_CIPSTART_COMMAND_INDEX]);
   set_flag(&sent_flag, CONNECT_TO_SERVER_FLAG);
}

void set_bytes_amount_to_send() {
   if (piped_request_commands_to_send[PIPED_REQUEST_CIPSEND_COMMAND_INDEX] == NULL) {
      return;
   }

   send_usard_data(piped_request_commands_to_send[PIPED_REQUEST_CIPSEND_COMMAND_INDEX]);
   set_flag(&sent_flag, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
}

void send_request() {
   if (piped_request_commands_to_send[PIPED_REQUEST_INDEX] == NULL) {
      return;
   }

   send_usard_data(piped_request_commands_to_send[PIPED_REQUEST_INDEX]);
   set_flag(&sent_flag, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
}

void on_successfully_receive_general_actions(unsigned short successfully_received_flag) {
   if (successfully_received_flag) {
      reset_flag(&successfully_received_flags, successfully_received_flag);
   }
   send_usart_data_function = NULL;
   send_usart_data_errors_counter = 0;
   remove_current_piped_task_to_send();
}

unsigned short get_current_piped_task_to_send() {
   return piped_tasks_to_send[0];
}

void remove_current_piped_task_to_send() {
   for (unsigned char i = 0; piped_tasks_to_send[i] != 0; i++) {
      unsigned int next_task = piped_tasks_to_send[i + 1];
      piped_tasks_to_send[i] = next_task;
   }
}

void add_piped_task_to_send_into_tail(unsigned int task) {
   for (unsigned char i = 0; i < PIPED_TASKS_TO_SEND_SIZE; i++) {
      if (piped_tasks_to_send[i] == 0) {
         piped_tasks_to_send[i] = task;
         break;
      }
   }
}

void add_piped_task_to_send_into_head(unsigned int task) {
   for (unsigned char i = PIPED_TASKS_TO_SEND_SIZE - 1; i != 0; i--) {
      piped_tasks_to_send[i] = piped_tasks_to_send[i - 1];
   }
   piped_tasks_to_send[0] = task;
}

void delete_piped_task(unsigned int task) {
   unsigned char task_is_found = 0;
   for (unsigned char i = 0; i < PIPED_TASKS_TO_SEND_SIZE; i++) {
      if (piped_tasks_to_send[i] == task || task_is_found) {
         piped_tasks_to_send[i] = piped_tasks_to_send[i + 1];
         task_is_found = 1;
      }

      if (piped_tasks_to_send[i] == 0) {
         break;
      }
   }
}

void delete_all_piped_tasks() {
   for (unsigned char i = 0; i < PIPED_TASKS_TO_SEND_SIZE; i++) {
     piped_tasks_to_send[i] = 0;
   }
}

unsigned char is_usart_response_contains_element(char string_to_be_contained[]) {
   if (contains_string(usart_data_received_buffer, string_to_be_contained)) {
      return 1;
   } else {
      return 0;
   }
}

//char *data_to_be_contained[] = {ESP8226_REQUEST_DISABLE_ECHO, USART_OK};
unsigned char is_usart_response_contains_elements(char *data_to_be_contained[], unsigned char elements_count) {
   for (unsigned char elements_index = 0; elements_index < elements_count; elements_index++) {
      if (!contains_string(usart_data_received_buffer, data_to_be_contained[elements_index])) {
         return 0;
      }
   }
   return 1;
}

unsigned char contains_string(char being_compared_string[], char string_to_be_contained[]) {
   unsigned char found = 0;

   if (*being_compared_string == '\0' || *string_to_be_contained == '\0') {
      return found;
   }

